In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
import numpy as np
import matplotlib.pyplot as plt
np.set_printoptions(precision=4, suppress=True)

In [2]:
obj = Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
obj.values

array([ 4,  7, -5,  3])

In [4]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [5]:
obj2 = Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']

-5

In [8]:
obj2[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [11]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [16]:
'b' in obj2

True

In [17]:
'e' in obj2

False

In [18]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
sdata

{'Ohio': 35000, 'Oregon': 16000, 'Texas': 71000, 'Utah': 5000}

In [19]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata,index= states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [21]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [23]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [24]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [26]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [28]:
obj4.name = 'populatiion'

In [29]:
obj4.index.name = 'state'

In [30]:
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: populatiion, dtype: float64

In [33]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [32]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [34]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
              'year': [2000, 2001, 2002, 2001, 2002],
              'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [35]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002]}

In [37]:
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [38]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [39]:
frame2 = DataFrame(data,columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five'])

In [40]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [41]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [42]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [43]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [45]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [46]:
frame2['debt']=16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [49]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [51]:
val = Series([-1.2,1.5,-1.7],index=['two','four','five'])
val

two    -1.2
four    1.5
five   -1.7
dtype: float64

In [52]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   1.5
five   2002  Nevada  2.9  -1.7

In [56]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4   1.5   False
five   2002  Nevada  2.9  -1.7   False

In [57]:
del frame2['eastern']
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   1.5
five   2002  Nevada  2.9  -1.7

In [58]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [59]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [60]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [61]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [62]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [63]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [65]:
pdata = {'Ohio':frame3['Ohio'][:-1],
                'Nevada':frame3['Nevada'][:2]}
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [64]:
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [66]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [67]:
frame3.index.name = 'year';frame3.columns.name = 'state';frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [68]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [69]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4   1.5
five   2002  Nevada  2.9  -1.7

In [70]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, 1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

In [79]:
obj = Series(range(3),index=['a','b','c'])
obj

a    0
b    1
c    2
dtype: int64

In [73]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [74]:
index[1:]

Index(['b', 'c'], dtype='object')

In [75]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [77]:
obj.index =['d','d','d']

In [78]:
obj

d    0
d    1
d    2
dtype: int64

In [81]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [82]:
obj2 = Series([1.5,-2.5,0],index=index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [88]:
obj2.index is index

True

In [89]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [90]:
'Ohio' in frame3.columns

True

In [91]:
2003 in frame3.index

False

In [97]:
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [98]:
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [99]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [100]:
obj3 = Series(['blue','purple','yellow'],index = [0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [104]:
obj3.reindex(range(6),method= 'ffill' )

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [101]:
range(6)

range(0, 6)

In [105]:
obj3.reindex(range(6),method= 'bfill' )

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [107]:
frame = DataFrame(np.arange(9).reshape((3,3)),index = ['a','c','d'],
                  columns = ['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [112]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

In [113]:
states = ['Texas','Utah','California']
frame.reindex(columns = states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [115]:
frame.reindex(index=['a','b','c','d','e'],method = 'ffill' , columns = states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8
e      7   NaN           8

In [116]:
frame.ix[['a','b','c','d','e'],states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8
e    NaN   NaN         NaN

In [119]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0
b    1
d    3
e    4
dtype: float64

In [121]:
obj.drop(['c','d'])

a    0
b    1
e    4
dtype: float64

In [122]:
data = DataFrame(np.arange(16).reshape((4,4)),
                                 index=['Ohio','Colorado','Utah','NewYork'],
                                 columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [123]:
data.drop(['Colorado','Ohio'])

         one  two  three  four
Utah       8    9     10    11
NewYork   12   13     14    15

In [127]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
NewYork    12     14    15

In [128]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
NewYork    12     14

In [130]:
obj = Series(np.arange(4.),index= ['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: float64

In [131]:
obj['b']

1.0

In [132]:
obj[1]

1.0

In [133]:
obj[2:4]

c    2
d    3
dtype: float64

In [134]:
obj[['b','a','d']]

b    1
a    0
d    3
dtype: float64

In [135]:
obj[[1,3]]

b    1
d    3
dtype: float64

In [136]:
obj[obj<2]

a    0
b    1
dtype: float64

In [137]:
obj['b':'d']

b    1
c    2
d    3
dtype: float64

In [139]:
obj['b':'d'] = 5
obj

a    0
b    5
c    5
d    5
dtype: float64

In [140]:
data = DataFrame(np.arange(16).reshape((4,4)),
                                 index=['Ohio','Colorado','Utah','NewYork'],
                                 columns = ['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [141]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [142]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [143]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
NewYork   False  False  False  False

In [146]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [147]:
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [148]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [150]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [151]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [152]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
NewYork    12   13     14

In [156]:
data.ix[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [157]:
data[data.three>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [158]:
data.three>5

Ohio        False
Colorado     True
Utah         True
NewYork      True
Name: three, dtype: bool

In [159]:
s1  = Series([7.3,-2.5,3.4,1.5],index = ['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1],index= ['a','c','e','f','g'])
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [162]:
df1 = DataFrame(np.arange(9.).reshape((3,3)),
                                    columns = list('bcd'),
                                    index = ['Ohio','Texas','Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [163]:
list('bcd')

['b', 'c', 'd']

In [164]:
df2 = DataFrame(np.arange(12.).reshape((4,3)),
                               columns = list('bde'),
                                index = ['Utah','Ohio','Texas','Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [165]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [166]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),
                               columns = list('abcd'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [168]:
df2 = DataFrame(np.arange(20).reshape((4,5)),
                                columns = list('abcde'))
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [169]:
df1 +df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [170]:
df1.add(df2,fill_value = 0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [171]:
df1.reindex(columns=df2.columns,fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [172]:
arr = np.arange(12.).reshape((3,4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [173]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [174]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [175]:
frame = DataFrame(np.arange(12.).reshape((4,3)),
                                      columns = list('bde'),
                                     index = ['Utah','Ohio','Texas','Oregon'])
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [177]:
series = frame.ix[0]
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [178]:
frame- series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [179]:
series2 = Series(range(3),index= list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [180]:
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [181]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [185]:
series3 = frame.ix[:,'d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [186]:
series3 = frame['d']
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [187]:
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [191]:
frame.sub(series3,axis = 0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

In [192]:
frame = DataFrame(np.random.randn(4,3),
                 columns = list('bde'),
                 index = ['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah    0.351044  0.609204 -0.272055
Ohio   -0.345762 -1.824804 -0.449676
Texas   0.373463  0.428112  0.559800
Oregon  0.481070 -1.397520  1.292243

In [193]:
np.abs(frame)

               b         d         e
Utah    0.351044  0.609204  0.272055
Ohio    0.345762  1.824804  0.449676
Texas   0.373463  0.428112  0.559800
Oregon  0.481070  1.397520  1.292243

In [194]:
f = lambda x: x.max() - x.min()

In [195]:
frame.apply(f,axis = 0)

b    0.826832
d    2.434008
e    1.741918
dtype: float64

In [196]:
frame.apply(f,axis = 1)

Utah      0.881260
Ohio      1.479042
Texas     0.186337
Oregon    2.689762
dtype: float64

In [212]:
def f(x):
     return Series([x.min(),x.max()],index = ['min','max'])

In [214]:
f = lambda x:  Series([x.min(),x.max()],index = ['min','max'])

In [215]:
frame.apply(f)

            b         d         e
min -0.345762 -1.824804 -0.449676
max  0.481070  0.609204  1.292243

In [216]:
frame

               b         d         e
Utah    0.351044  0.609204 -0.272055
Ohio   -0.345762 -1.824804 -0.449676
Texas   0.373463  0.428112  0.559800
Oregon  0.481070 -1.397520  1.292243

In [217]:
# %.2f 2% xx
format = lambda x: '%.2f' % x

In [232]:
frame.applymap(format)

            b      d      e
Utah     0.35   0.61  -0.27
Ohio    -0.35  -1.82  -0.45
Texas    0.37   0.43   0.56
Oregon   0.48  -1.40   1.29

In [226]:
frame.ix[0,0]

0.35104405519410936

In [229]:
frame['e'].map(format)

Utah      -0.27
Ohio      -0.45
Texas      0.56
Oregon     1.29
Name: e, dtype: object

In [255]:
obj = Series(range(4),index = list('dabc'))
obj

d    0
a    1
b    2
c    3
dtype: int64

In [256]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [257]:
frame = DataFrame(np.arange(8).reshape((2,4)),
                                   index = ['three','one'],
                                    columns = list('dabc'))
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [239]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [240]:
frame.sort_index(axis = 0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [241]:
frame.sort_index(axis = 1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [258]:
frame.sort_index(axis = 1,ascending = False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [243]:
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [246]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [248]:
obj.order()

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -3
3    2
0    4
1    7
dtype: int64

In [249]:
obj = Series([4,np.nan,7,np.nan,-3,2])
obj

0     4
1   NaN
2     7
3   NaN
4    -3
5     2
dtype: float64

In [250]:
obj.order()

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [251]:
obj.sort_values()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [260]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [261]:
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [262]:
frame.sort_values(by = ['a','b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [263]:
frame.sort_index(by = ['a','b'])

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [264]:
obj = Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [265]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [270]:
obj.rank(method = 'first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [271]:
obj.rank(ascending = False , method ='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [272]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [273]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [276]:
frame.rank(axis= 1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

In [277]:
obj = Series(range(5),index = list('aabbc'))
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [284]:
obj.index.is_unique

False

In [285]:
obj['a']

a    0
a    1
dtype: int64

In [286]:
obj['c']

4

In [4]:
df = DataFrame(np.random.randn(4,3),index = list('aabb'))
df

          0         1         2
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004

In [5]:
df.ix['b']

          0         1         2
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004

In [6]:
df['a':'b']

          0         1         2
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004

In [7]:
obj

NameError: name 'obj' is not defined

In [8]:
obj['a']

NameError: name 'obj' is not defined

In [9]:
obj.ix['a':'c']

NameError: name 'obj' is not defined

In [10]:
obj.ix[1:3]

NameError: name 'obj' is not defined

In [11]:
df

          0         1         2
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004

In [12]:
df[1]

a   -0.857062
a   -0.752627
b   -0.615759
b    0.465261
Name: 1, dtype: float64

In [13]:
df[0:2]

          0         1         2
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349

In [14]:
coln = np.copy(df.columns)
coln = list('ABC')
df.columns = coln

In [15]:
df[1:3]

          A         B         C
a  0.559174 -0.752627  0.035349
b -0.374733 -0.615759  0.973668

In [16]:
df

          A         B         C
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004

In [17]:
df.ix[2,'A']

-0.37473283544016056

In [19]:
df[[1,2]]

          B         C
a -0.857062  2.014756
a -0.752627  0.035349
b -0.615759  0.973668
b  0.465261  2.119004

In [29]:
df.sort_index(axis = 0,ascending=False)

          A         B         C
b -0.374733 -0.615759  0.973668
b -1.114186  0.465261  2.119004
a -0.434424 -0.857062  2.014756
a  0.559174 -0.752627  0.035349

In [4]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index = list('abcd'),columns = ['one','two']);df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [5]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis = 1,skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [8]:
df.idxmin()

one    d
two    b
dtype: object

In [9]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [11]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [14]:
obj = Series(list('aabc')*4);obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [15]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [20]:
import pandas.io.data as web
all_data = {}

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/pandas/io/data.py:33: FutureWarning:
The pandas.io.data module is moved to a separate package (pandas-datareader) and will be removed from pandas in a future version.
After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.
  FutureWarning)

In [22]:
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

AttributeError: 'dict' object has no attribute 'iteritems'

In [23]:
obj = Series(list('cadaabbcc'));obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [24]:
uniques = obj.unique();uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [31]:
len(uniques)

4

In [33]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [34]:
pd.value_counts(obj.values,sort = False)

b    2
a    3
d    1
c    3
dtype: int64

In [56]:
mask = obj.isin(['b','c']);mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [39]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [42]:
data = DataFrame({'Quo1':[1,3,4,3,4],
                                    'Quo2':[2,3,1,2,3],
                                    'Quo3':[1,5,2,4,4]}) 
data

   Quo1  Quo2  Quo3
0     1     2     1
1     3     3     5
2     4     1     2
3     3     2     4
4     4     3     4

In [54]:
result = data.apply(pd.value_counts,axis=0).fillna(0);result

   Quo1  Quo2  Quo3
1     1     1     1
2     0     2     1
3     2     2     0
4     2     0     2
5     0     0     1

In [50]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado']);string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [51]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [58]:
string_data[0] =None

In [59]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [60]:
from numpy import nan as NA

In [62]:
data = Series([1,NA,3.5,NA,7]);data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [63]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [64]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [65]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [66]:
cleaned = data.dropna();cleaned

   0    1  2
0  1  6.5  3

In [67]:
data.dropna(how ='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [70]:
data[4] = NA;data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [72]:
data.dropna(axis=1,how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [73]:
df = DataFrame(np.random.randn(7,3));df

          0         1         2
0 -0.367853  1.332350 -1.422039
1  0.092327  1.866713  0.838362
2 -0.137823  2.253331 -0.354357
3  1.779946  0.266996 -0.546667
4  0.676733 -0.450396  0.475982
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [75]:
df.ix[:4,1] = NA;df.ix[:2,2 ] = NA;df

          0         1         2
0 -0.367853       NaN       NaN
1  0.092327       NaN       NaN
2 -0.137823       NaN       NaN
3  1.779946       NaN -0.546667
4  0.676733       NaN  0.475982
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [76]:
df.dropna(thresh=3)

          0         1         2
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [77]:
df.fillna(0)

          0         1         2
0 -0.367853  0.000000  0.000000
1  0.092327  0.000000  0.000000
2 -0.137823  0.000000  0.000000
3  1.779946  0.000000 -0.546667
4  0.676733  0.000000  0.475982
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [79]:
df.fillna({1:0.5,3:-1})

          0         1         2
0 -0.367853  0.500000       NaN
1  0.092327  0.500000       NaN
2 -0.137823  0.500000       NaN
3  1.779946  0.500000 -0.546667
4  0.676733  0.500000  0.475982
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [81]:
_ = df.fillna(0,inplace=True)
df

          0         1         2
0 -0.367853  0.000000  0.000000
1  0.092327  0.000000  0.000000
2 -0.137823  0.000000  0.000000
3  1.779946  0.000000 -0.546667
4  0.676733  0.000000  0.475982
5  0.581731 -2.229237 -0.740118
6  0.551678 -1.889652 -1.384399

In [82]:
df = DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.015119  0.199868 -1.153722
1 -1.727889 -0.397054  0.301924
2  1.436067  0.357647 -0.896549
3  0.494349  0.661839 -0.996450
4  0.031451 -1.195503  0.408984
5  0.946438  1.570290 -1.406208

In [84]:
df.ix[2:,1] = NA ;df.ix[4:,2] = NA;df

          0         1         2
0  0.015119  0.199868 -1.153722
1 -1.727889 -0.397054  0.301924
2  1.436067       NaN -0.896549
3  0.494349       NaN -0.996450
4  0.031451       NaN       NaN
5  0.946438       NaN       NaN

In [85]:
df.fillna(method='ffill')

          0         1         2
0  0.015119  0.199868 -1.153722
1 -1.727889 -0.397054  0.301924
2  1.436067 -0.397054 -0.896549
3  0.494349 -0.397054 -0.996450
4  0.031451 -0.397054 -0.996450
5  0.946438 -0.397054 -0.996450

In [86]:
df.fillna(method = 'ffill',limit=2)

          0         1         2
0  0.015119  0.199868 -1.153722
1 -1.727889 -0.397054  0.301924
2  1.436067 -0.397054 -0.896549
3  0.494349 -0.397054 -0.996450
4  0.031451       NaN -0.996450
5  0.946438       NaN -0.996450

In [88]:
data = Series([1,NA,3.5,NA,7]);data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [89]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [90]:
data.fillna(data.median())

0    1.0
1    3.5
2    3.5
3    3.5
4    7.0
dtype: float64

In [91]:
data = Series(np.random.randn(10),index =[list('aaabbbccdd'),[1,2,3,1,2,3,1,2,2,3]]);data

a  1   -1.469548
   2   -1.449113
   3    0.611519
b  1   -0.314948
   2    1.106098
   3    0.088884
c  1    0.445355
   2    0.047667
d  2   -0.361706
   3    0.447586
dtype: float64

In [92]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [93]:
data['b']

1   -0.314948
2    1.106098
3    0.088884
dtype: float64

In [94]:
data['b':'c']

b  1   -0.314948
   2    1.106098
   3    0.088884
c  1    0.445355
   2    0.047667
dtype: float64

In [95]:
data.ix[['b','d']]

b  1   -0.314948
   2    1.106098
   3    0.088884
d  2   -0.361706
   3    0.447586
dtype: float64

In [96]:
data[:,2]

a   -1.449113
b    1.106098
c    0.047667
d   -0.361706
dtype: float64

In [97]:
data.unstack()

          1         2         3
a -1.469548 -1.449113  0.611519
b -0.314948  1.106098  0.088884
c  0.445355  0.047667       NaN
d       NaN -0.361706  0.447586

In [98]:
data.unstack().stack()

a  1   -1.469548
   2   -1.449113
   3    0.611519
b  1   -0.314948
   2    1.106098
   3    0.088884
c  1    0.445355
   2    0.047667
d  2   -0.361706
   3    0.447586
dtype: float64

In [99]:
frame = DataFrame(np.arange(12).reshape((4,3)),index= [list('aabb'),[1,2,1,2]],columns= [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [100]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [101]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [102]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [103]:
MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names = ['state','color'])

NameError: name 'MultiIndex' is not defined

In [104]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [105]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [106]:
frame.swaplevel(0,1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [107]:
frame.sum(level = 'key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [108]:
frame.sum(level='color',axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [109]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [110]:
frame2 = frame.set_index(['c','d']);frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [111]:
frame.set_index(['c','d'],drop = False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [114]:
frame2.reset_index().sort_index(axis=1)

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [116]:
ser = Series(np.arange(3.));ser

0    0
1    1
2    2
dtype: float64

In [117]:
ser[-1]

KeyError: -1

In [119]:
ser2 = Series(np.arange(3.),index = list('abc'));ser2[-1]

2.0

In [121]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [122]:
ser3 = Series(range(3),index =[-5,1,3]);ser3

-5    0
 1    1
 3    2
dtype: int64

In [123]:
ser3.iget_value(2)

/Users/keeeeei/.pyenv/versions/anaconda3-2.5.0/lib/python3.5/site-packages/ipykernel/__main__.py:1: FutureWarning: iget_value(i) is deprecated. Please use .iloc[i] or .iat[i]
  if __name__ == '__main__':

2

In [128]:
frame = DataFrame(np.arange(6).reshape(3,2),index=[2,0,1]);frame

   0  1
2  0  1
0  2  3
1  4  5

In [139]:
#ilocloc
frame.iloc[1,1]

3